; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v2 ?v8)
             (pred_1 ?v1 ?v9)
             (pred_4 ?v2 ?v9)
             (pred_2 ?v10 ?v2 )
	     (pred_6 ?v2)
             (pred_11 ?v13)
             (pred_5 ?v1)
             (pred_9 ?v9)
             (pred_8 ?v2)
             (pred_10 ?v1)
             (pred_7 ?v2)
             (pred_12 ))



(:action op_1
:parameters (?v12 ?v4 ?v5 ?v7)
:precondition (and (pred_11 ?v12) (pred_11 ?v4) (pred_5 ?v5) (pred_9 ?v7)
          (pred_3 ?v12 ?v4) (pred_1 ?v5 ?v7)
                   (pred_4 ?v4 ?v7) (pred_6 ?v12) 
                   (pred_8 ?v4) (pred_10 ?v5))
:effect (and  (pred_7 ?v4) (not (pred_8 ?v4))))


(:action op_4
:parameters (?v12 ?v3)
:precondition (and (pred_11 ?v12) (pred_11 ?v3)
               (pred_6 ?v12) (pred_3 ?v12 ?v3) (pred_7 ?v3))
:effect (and (pred_6 ?v3) (not (pred_6 ?v12))))

(:action op_3
:parameters (?v12 ?v5)
:precondition (and (pred_11 ?v12) (pred_5 ?v5) 
                  (pred_6 ?v12) (pred_2 ?v5 ?v12) (pred_12 ))
:effect (and (pred_10 ?v5)
   (not (pred_2 ?v5 ?v12)) (not (pred_12 ))))


(:action op_2
:parameters (?v12 ?v11 ?v6)
:precondition (and (pred_11 ?v12) (pred_5 ?v11) (pred_5 ?v6)
                  (pred_6 ?v12) (pred_10 ?v6) (pred_2 ?v11 ?v12))
:effect (and (pred_10 ?v11) (pred_2 ?v6 ?v12)
        (not (pred_10 ?v6)) (not (pred_2 ?v11 ?v12))))

(:action op_5
:parameters (?v12 ?v5)
:precondition (and (pred_11 ?v12) (pred_5 ?v5) 
                  (pred_6 ?v12) (pred_10 ?v5))
:effect (and (pred_12 ) (pred_2 ?v5 ?v12) (not (pred_10 ?v5)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_12 obj_20 obj_11 obj_16 obj_14 obj_03 obj_13 obj_05 obj_09 obj_04 obj_02 obj_15 obj_01 obj_08 obj_07
    obj_06 obj_17
    obj_18 obj_19
    )

    (:init
       (pred_12)

       (pred_11 obj_10)
       (pred_11 obj_12)
       (pred_11 obj_20)
       (pred_11 obj_11)
       (pred_11 obj_16)
       (pred_11 obj_14)
       (pred_11 obj_03)
       (pred_11 obj_13)
       (pred_11 obj_05)
       (pred_11 obj_09)
       (pred_11 obj_04)
       (pred_11 obj_02)
       (pred_11 obj_15)
       (pred_11 obj_01)
       (pred_11 obj_08)
       (pred_11 obj_07)
       (pred_9 obj_06)
       (pred_9 obj_17)
       (pred_5 obj_18)
       (pred_5 obj_19)

       (pred_3 obj_10 obj_16)
       (pred_3 obj_10 obj_12)
       (pred_3 obj_12 obj_14)
       (pred_3 obj_12 obj_20)
       (pred_3 obj_12 obj_10)
       (pred_3 obj_20 obj_03)
       (pred_3 obj_20 obj_11)
       (pred_3 obj_20 obj_12)
       (pred_3 obj_11 obj_13)
       (pred_3 obj_11 obj_20)
       (pred_3 obj_16 obj_05)
       (pred_3 obj_16 obj_14)
       (pred_3 obj_16 obj_10)
       (pred_3 obj_14 obj_09)
       (pred_3 obj_14 obj_03)
       (pred_3 obj_14 obj_12)
       (pred_3 obj_14 obj_16)
       (pred_3 obj_03 obj_04)
       (pred_3 obj_03 obj_13)
       (pred_3 obj_03 obj_20)
       (pred_3 obj_03 obj_14)
       (pred_3 obj_13 obj_02)
       (pred_3 obj_13 obj_11)
       (pred_3 obj_13 obj_03)
       (pred_3 obj_05 obj_15)
       (pred_3 obj_05 obj_09)
       (pred_3 obj_05 obj_16)
       (pred_3 obj_09 obj_01)
       (pred_3 obj_09 obj_04)
       (pred_3 obj_09 obj_14)
       (pred_3 obj_09 obj_05)
       (pred_3 obj_04 obj_08)
       (pred_3 obj_04 obj_02)
       (pred_3 obj_04 obj_03)
       (pred_3 obj_04 obj_09)
       (pred_3 obj_02 obj_07)
       (pred_3 obj_02 obj_13)
       (pred_3 obj_02 obj_04)
       (pred_3 obj_15 obj_01)
       (pred_3 obj_15 obj_05)
       (pred_3 obj_01 obj_08)
       (pred_3 obj_01 obj_09)
       (pred_3 obj_01 obj_15)
       (pred_3 obj_08 obj_07)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_08 obj_01)
       (pred_3 obj_07 obj_02)
       (pred_3 obj_07 obj_08)
       (pred_8 obj_13)
       (pred_8 obj_16)
       (pred_4  obj_13 obj_06)
       (pred_4  obj_16 obj_17)
       (pred_7 obj_10)
       (pred_7 obj_12)
       (pred_7 obj_20)
       (pred_7 obj_11)
       (pred_7 obj_14)
       (pred_7 obj_03)
       (pred_7 obj_05)
       (pred_7 obj_09)
       (pred_7 obj_04)
       (pred_7 obj_02)
       (pred_7 obj_15)
       (pred_7 obj_01)
       (pred_7 obj_08)
       (pred_7 obj_07)

       (pred_1  obj_18 obj_06)
       (pred_1  obj_19 obj_17)
       (pred_2 obj_18 obj_16)
       (pred_2 obj_19 obj_10)
       (pred_6 obj_12)
    )

    (:goal (and
       (pred_2 obj_19 obj_07)
    ))
(:constraints
  (always (not (pred_6 obj_04)))
)
)

; plan
1. (op_4 obj_12 obj_10)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_10)
   goals met: 0 of 1
2. (op_3 obj_10 obj_19)
   deleted: (pred_2 obj_19 obj_10) (pred_12)
   added: (pred_10 obj_19)
   goals met: 0 of 1
3. (op_4 obj_10 obj_12)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_12)
   goals met: 0 of 1
4. (op_4 obj_12 obj_14)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_14)
   goals met: 0 of 1
5. (op_4 obj_14 obj_09)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_09)
   goals met: 0 of 1
6. (op_4 obj_09 obj_01)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_01)
   goals met: 0 of 1
7. (op_4 obj_01 obj_08)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_08)
   goals met: 0 of 1
8. (op_4 obj_08 obj_07)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_07)
   goals met: 0 of 1
9. (op_5 obj_07 obj_19)
   deleted: (pred_10 obj_19)
   added: (pred_12) (pred_2 obj_19 obj_07)
   goals met: 1 of 1
